fasmide/esp32_calthing/esp32ui/src/main.cpp
// ESP32 full-screen agenda UI backed by the calendar daemon.

#include <Arduino.h>
#include <ArduinoJson.h>
#include <Arduino_GFX_Library.h>
#include <ESP32_4848S040.h>
#include <HTTPClient.h>
#include <WiFi.h>
#include <lvgl.h>
#include <time.h>

#include "app_config.h"
#include "touch.h"

LV_FONT_DECLARE(app_font_14);
LV_FONT_DECLARE(app_font_16);
LV_FONT_DECLARE(app_font_20);
LV_FONT_DECLARE(app_font_24);

#define GFX_BL 38

#define BLACK 0x0000

#define TFT_HOR_RES 480
#define TFT_VER_RES 480
#define TFT_ROTATION LV_DISPLAY_ROTATION_0
#define TFT_BRIGHTNESS 255
#define DRAW_BUF_SIZE (TFT_HOR_RES * TFT_VER_RES / 10 * (LV_COLOR_DEPTH / 8))
#define TFT_BOUNCE_BUFFER_PX (TFT_HOR_RES * 10)

#define APP_EVENT_CAPACITY 96
#define APP_EVENT_PAGE_LIMIT 12
#define APP_QUERY_DAYS 7
#define APP_REFRESH_INTERVAL_MS (5UL * 60UL * 1000UL)
#define APP_PULL_REFRESH_THRESHOLD 80

#define EVENT_START_COLOR 0x6EE7B7
#define EVENT_END_COLOR 0xFF8A65

Arduino_ESP32SPI *bus;
Arduino_RGB_Display *gfx;
uint32_t draw_buf[DRAW_BUF_SIZE / 4];

struct CalendarEvent {
  String id;
  String title;
  String description;
  String location;
  time_t startTs;
  time_t endTs;
  time_t createdTs;
  bool allDay;
};

enum EventTimingState {
  EVENT_TIMING_NONE,
  EVENT_TIMING_UPCOMING,
  EVENT_TIMING_ONGOING,
};

struct AppState {
  CalendarEvent events[APP_EVENT_CAPACITY];
  int eventCount = 0;
  time_t rangeStart = 0;
  time_t rangeEnd = 0;
  time_t lastSyncTs = 0;
  time_t lastRenderMinuteTs = 0;
  unsigned long lastRefreshMs = 0;
  bool refreshRequested = true;
  bool fetchInProgress = false;
  bool wifiReady = false;
  bool clockReady = false;
  bool pullRefreshArmed = false;
  bool pullRefreshInProgress = false;
  unsigned long refreshOverlayShownAt = 0;
  String statusText;
  String detailText;
  String openDetailEventId;
} app;

static lv_style_t style_screen;
static lv_style_t style_day_panel;
static lv_style_t style_event_card;
static lv_style_t style_modal;
static lv_style_t style_fab;
static lv_style_t style_status;

static lv_obj_t *agenda_panel;
static lv_obj_t *status_pill;
static lv_obj_t *status_label;
static lv_obj_t *back_button;
static lv_obj_t *detail_overlay;
static lv_obj_t *detail_title_label;
static lv_obj_t *detail_body_label;
static lv_obj_t *refresh_overlay;
static lv_obj_t *refresh_label;

void my_disp_flush(lv_display_t *disp, const lv_area_t *area, uint8_t *px_map) {
  uint32_t w = (area->x2 - area->x1 + 1);
  uint32_t h = (area->y2 - area->y1 + 1);

#if (LV_COLOR_16_SWAP != 0)
  gfx->draw16bitBeRGBBitmap(area->x1, area->y1, (uint16_t *)px_map, w, h);
#else
  gfx->draw16bitRGBBitmap(area->x1, area->y1, (uint16_t *)px_map, w, h);
#endif

  lv_disp_flush_ready(disp);
}

void my_touchpad_read(lv_indev_t *indev, lv_indev_data_t *data) {
  if (touch_has_signal() && touch_touched()) {
    data->state = LV_INDEV_STATE_PRESSED;
    data->point.x = touch_last_x;
    data->point.y = touch_last_y;
    return;
  }

  data->state = LV_INDEV_STATE_RELEASED;
}

static uint32_t my_tick(void) {
  return millis();
}

bool hasAppConfig() {
  return strlen(APP_WIFI_SSID) > 0 && strlen(APP_DAEMON_URL) > 0 && strlen(APP_API_TOKEN) > 0;
}

String urlEncode(const String &value) {
  String encoded;
  const char *hex = "0123456789ABCDEF";

  for (size_t i = 0; i < value.length(); ++i) {
    const char c = value.charAt(i);
    const bool unreserved = isalnum(static_cast<unsigned char>(c)) || c == '-' || c == '_' || c == '.' || c == '~';
    if (unreserved) {
      encoded += c;
      continue;
    }

    encoded += '%';
    encoded += hex[(c >> 4) & 0x0F];
    encoded += hex[c & 0x0F];
  }

  return encoded;
}

time_t startOfLocalDay(time_t value) {
  struct tm parts;
  localtime_r(&value, &parts);
  parts.tm_hour = 0;
  parts.tm_min = 0;
  parts.tm_sec = 0;
  return mktime(&parts);
}

String formatRfc3339(time_t value) {
  struct tm parts;
  gmtime_r(&value, &parts);

  char buffer[32];
  strftime(buffer, sizeof(buffer), "%Y-%m-%dT%H:%M:%SZ", &parts);
  return String(buffer);
}

String formatDayTitle(time_t value) {
  struct tm parts;
  localtime_r(&value, &parts);

  char buffer[48];
  strftime(buffer, sizeof(buffer), "%A", &parts);
  return String(buffer);
}

String formatDaySubtitle(time_t value) {
  struct tm parts;
  localtime_r(&value, &parts);

  char buffer[48];
  strftime(buffer, sizeof(buffer), "%d %b %Y", &parts);
  return String(buffer);
}

String formatTimeRange(const CalendarEvent &event) {
  if (event.allDay) {
    return "All day";
  }

  struct tm startParts;
  struct tm endParts;
  localtime_r(&event.startTs, &startParts);
  localtime_r(&event.endTs, &endParts);

  char startBuffer[16];
  char endBuffer[16];
  strftime(startBuffer, sizeof(startBuffer), "%H:%M", &startParts);
  strftime(endBuffer, sizeof(endBuffer), "%H:%M", &endParts);

  return String(startBuffer) + " - " + endBuffer;
}

String formatRelativeDuration(time_t seconds) {
  if (seconds < 0) {
    seconds = -seconds;
  }

  const long days = seconds / 86400;
  seconds %= 86400;
  const long hours = seconds / 3600;
  const long minutes = (seconds % 3600) / 60;

  String result;
  if (days > 0) {
    result += String(days) + "d";
  }
  if (hours > 0) {
    if (!result.isEmpty()) {
      result += " ";
    }
    result += String(hours) + "h";
  }
  if (minutes > 0 || result.isEmpty()) {
    if (!result.isEmpty()) {
      result += " ";
    }
    result += String(minutes) + "m";
  }
  return result;
}

EventTimingState getEventTimingState(const CalendarEvent &event) {
  if (event.allDay) {
    return EVENT_TIMING_NONE;
  }

  const time_t now = time(nullptr);
  if (now < 1700000000) {
    return EVENT_TIMING_NONE;
  }

  if (now < event.startTs) {
    return EVENT_TIMING_UPCOMING;
  }
  if (now < event.endTs) {
    return EVENT_TIMING_ONGOING;
  }
  return EVENT_TIMING_NONE;
}

String formatEventStatus(const CalendarEvent &event) {
  const EventTimingState state = getEventTimingState(event);
  if (state == EVENT_TIMING_UPCOMING) {
    return formatRelativeDuration(event.startTs - time(nullptr));
  }
  if (state == EVENT_TIMING_ONGOING) {
    return formatRelativeDuration(event.endTs - time(nullptr));
  }
  return "";
}

lv_color_t getEventTimingColor(EventTimingState state) {
  if (state == EVENT_TIMING_UPCOMING) {
    return lv_color_hex(EVENT_START_COLOR);
  }
  if (state == EVENT_TIMING_ONGOING) {
    return lv_color_hex(EVENT_END_COLOR);
  }
  return lv_color_hex(0xD2DCEB);
}

