fasmide/esp32_calthing/esp32ui/src/main.cpp
String colorizeStatusText(const String &text, EventTimingState state) {
  if (text.isEmpty() || state == EVENT_TIMING_NONE) {
    return text;
  }

  char color[8];
  const uint32_t value = state == EVENT_TIMING_UPCOMING ? EVENT_START_COLOR : EVENT_END_COLOR;
  snprintf(color, sizeof(color), "%06lX", static_cast<unsigned long>(value));
  return String("#") + color + " " + text + "#";
}

String formatCreatedTimestamp(time_t value) {
  if (value <= 0) {
    return "Unknown";
  }

  struct tm parts;
  localtime_r(&value, &parts);

  char buffer[32];
  strftime(buffer, sizeof(buffer), "%Y-%m-%d %H:%M:%S", &parts);
  return String(buffer);
}

void setStatus(const String &text, bool visible) {
  app.statusText = text;
  if (status_label != nullptr) {
    lv_label_set_text(status_label, app.statusText.c_str());
  }
  if (status_pill != nullptr) {
    if (visible) {
      lv_obj_clear_flag(status_pill, LV_OBJ_FLAG_HIDDEN);
    } else {
      lv_obj_add_flag(status_pill, LV_OBJ_FLAG_HIDDEN);
    }
  }
}

void setRefreshOverlay(const String &text, bool visible) {
  if (refresh_overlay == nullptr || refresh_label == nullptr) {
    return;
  }

  lv_label_set_text(refresh_label, text.c_str());
  if (visible) {
    app.refreshOverlayShownAt = millis();
    lv_obj_clear_flag(refresh_overlay, LV_OBJ_FLAG_HIDDEN);
    lv_obj_move_foreground(refresh_overlay);
  } else {
    if (!lv_obj_has_flag(refresh_overlay, LV_OBJ_FLAG_HIDDEN)) {
      const unsigned long elapsed = millis() - app.refreshOverlayShownAt;
      if (elapsed < 250) {
        const unsigned long remaining = 250 - elapsed;
        const unsigned long startedAt = millis();
        while (millis() - startedAt < remaining) {
          lv_timer_handler();
          delay(5);
        }
      }
    }
    lv_obj_add_flag(refresh_overlay, LV_OBJ_FLAG_HIDDEN);
  }
}

void hideDetailOverlay();

void onDetailBackdropPressed(lv_event_t *e) {
  LV_UNUSED(e);
  hideDetailOverlay();
}

void showDetailOverlay(const CalendarEvent &event) {
  if (detail_overlay == nullptr) {
    return;
  }

  app.openDetailEventId = event.id;

  lv_label_set_text(detail_title_label, event.title.c_str());

  String details = formatTimeRange(event);
  const EventTimingState timingState = getEventTimingState(event);
  const String relative = formatEventStatus(event);
  if (!relative.isEmpty()) {
    details += "\n";
    details += colorizeStatusText(relative, timingState);
  }
  if (!event.location.isEmpty()) {
    details += "\n";
    details += event.location;
  }
  if (!event.description.isEmpty()) {
    details += "\n\n";
    details += event.description;
  }
  details += "\nCreated ";
  details += formatCreatedTimestamp(event.createdTs);
  details += "\n\n";
  details += event.id;
  app.detailText = details;
  lv_label_set_text(detail_body_label, app.detailText.c_str());

  lv_obj_clear_flag(detail_overlay, LV_OBJ_FLAG_HIDDEN);
  lv_obj_move_foreground(detail_overlay);
}

void hideDetailOverlay() {
  if (detail_overlay != nullptr) {
    lv_obj_add_flag(detail_overlay, LV_OBJ_FLAG_HIDDEN);
  }
  app.openDetailEventId = "";
}

void onEventPressed(lv_event_t *e) {
  CalendarEvent *event = static_cast<CalendarEvent *>(lv_event_get_user_data(e));
  if (event != nullptr) {
    showDetailOverlay(*event);
  }
}

void updateBackButtonVisibility() {
  if (agenda_panel == nullptr || back_button == nullptr) {
    return;
  }

  lv_coord_t scrollY = lv_obj_get_scroll_y(agenda_panel);
  if (scrollY > 80) {
    lv_obj_clear_flag(back_button, LV_OBJ_FLAG_HIDDEN);
    lv_obj_move_foreground(back_button);
  } else {
    lv_obj_add_flag(back_button, LV_OBJ_FLAG_HIDDEN);
  }
}

void onAgendaScrolled(lv_event_t *e) {
  LV_UNUSED(e);

  if (agenda_panel != nullptr && !app.fetchInProgress && !app.pullRefreshInProgress) {
    const lv_coord_t scrollY = lv_obj_get_scroll_y(agenda_panel);
    if (scrollY < -APP_PULL_REFRESH_THRESHOLD) {
      app.pullRefreshArmed = true;
      setStatus("Release to refresh", true);
    } else if (scrollY < -40) {
      app.pullRefreshArmed = false;
      setStatus("Pull to refresh", true);
    } else if (!app.fetchInProgress) {
      app.pullRefreshArmed = false;
      if (app.eventCount > 0) {
        setStatus("", false);
      }
    }
  }

  updateBackButtonVisibility();
}

void onAgendaScrollEnd(lv_event_t *e) {
  LV_UNUSED(e);

  if (!app.pullRefreshArmed || agenda_panel == nullptr || app.fetchInProgress || app.pullRefreshInProgress) {
    return;
  }

  app.pullRefreshArmed = false;
  app.pullRefreshInProgress = true;
  app.refreshRequested = true;
  setStatus("Refreshing source", true);
  setRefreshOverlay("Refreshing calendar...", true);
}

void onBackPressed(lv_event_t *e) {
  LV_UNUSED(e);
  if (agenda_panel == nullptr) {
    return;
  }

  lv_obj_scroll_to_y(agenda_panel, 0, LV_ANIM_ON);
  hideDetailOverlay();
}

void initStyles() {
  lv_style_init(&style_screen);
  lv_style_set_bg_color(&style_screen, lv_color_hex(0x07111D));
  lv_style_set_bg_grad_color(&style_screen, lv_color_hex(0x12233C));
  lv_style_set_bg_grad_dir(&style_screen, LV_GRAD_DIR_VER);
  lv_style_set_text_color(&style_screen, lv_color_hex(0xF4F7FB));

  lv_style_init(&style_day_panel);
  lv_style_set_bg_color(&style_day_panel, lv_color_hex(0x0F1B2C));
  lv_style_set_border_width(&style_day_panel, 1);
  lv_style_set_border_color(&style_day_panel, lv_color_hex(0x223552));
  lv_style_set_radius(&style_day_panel, 18);
  lv_style_set_pad_all(&style_day_panel, 14);

  lv_style_init(&style_event_card);
  lv_style_set_bg_color(&style_event_card, lv_color_hex(0x162741));
  lv_style_set_border_width(&style_event_card, 1);
  lv_style_set_border_color(&style_event_card, lv_color_hex(0x2E4B74));
  lv_style_set_radius(&style_event_card, 16);
  lv_style_set_pad_all(&style_event_card, 14);
  lv_style_set_text_color(&style_event_card, lv_color_hex(0xF4F7FB));

  lv_style_init(&style_modal);
  lv_style_set_bg_color(&style_modal, lv_color_hex(0x0E1A2D));
  lv_style_set_border_width(&style_modal, 1);
  lv_style_set_border_color(&style_modal, lv_color_hex(0x426389));
  lv_style_set_radius(&style_modal, 22);
  lv_style_set_pad_all(&style_modal, 18);

  lv_style_init(&style_fab);
  lv_style_set_bg_color(&style_fab, lv_color_hex(0x2B558C));
  lv_style_set_radius(&style_fab, LV_RADIUS_CIRCLE);
  lv_style_set_pad_hor(&style_fab, 18);
  lv_style_set_pad_ver(&style_fab, 12);
  lv_style_set_shadow_width(&style_fab, 0);

  lv_style_init(&style_status);
  lv_style_set_bg_color(&style_status, lv_color_hex(0x203653));
  lv_style_set_radius(&style_status, LV_RADIUS_CIRCLE);
  lv_style_set_pad_hor(&style_status, 12);
  lv_style_set_pad_ver(&style_status, 6);
}

void resetEvents() {
  app.eventCount = 0;
  for (int i = 0; i < APP_EVENT_CAPACITY; ++i) {
    app.events[i] = CalendarEvent();
  }
}

bool appendEvents(JsonArray events) {
  for (JsonObject item : events) {
    if (app.eventCount >= APP_EVENT_CAPACITY) {
      return false;
    }

    CalendarEvent &event = app.events[app.eventCount++];
    event.id = String(item["id"] | "");
    event.title = String(item["title"] | "(untitled)");
    event.description = String(item["description"] | "");
    event.location = String(item["location"] | "");
    event.startTs = item["start_ts"] | 0;
    event.endTs = item["end_ts"] | event.startTs;
    event.createdTs = item["created_ts"] | 0;
    event.allDay = item["all_day"] | false;
  }
  return true;
}

