fasmide/esp32_calthing/esp32ui/src/main.cpp
bool fetchAgendaWindow() {
  if (!app.wifiReady) {
    setStatus("Wi-Fi offline", true);
    setRefreshOverlay("", false);
    return false;
  }

  app.fetchInProgress = true;
  resetEvents();
  setStatus("Syncing calendar", true);

  String nextCursor;
  bool hasMore = false;
  int pageCount = 0;

  do {
    String url = String(APP_DAEMON_URL) + "/v1/events?from=" + urlEncode(formatRfc3339(app.rangeStart));
    url += "&to=" + urlEncode(formatRfc3339(app.rangeEnd));
    url += "&limit=" + String(APP_EVENT_PAGE_LIMIT);
    if (nextCursor.length() > 0) {
      url += "&cursor=" + urlEncode(nextCursor);
    }

    WiFiClient client;
    HTTPClient http;
    http.setConnectTimeout(8000);
    http.setTimeout(12000);

    if (!http.begin(client, url)) {
      setStatus("Request setup failed", true);
      setRefreshOverlay("", false);
      app.fetchInProgress = false;
      return false;
    }

    http.addHeader("Authorization", String("Bearer ") + APP_API_TOKEN);

    const int httpCode = http.GET();
    if (httpCode != HTTP_CODE_OK) {
      String errorText = http.errorToString(httpCode);
      http.end();
      setStatus("Fetch failed: " + errorText, true);
      setRefreshOverlay("", false);
      app.fetchInProgress = false;
      return false;
    }

    String payload = http.getString();
    http.end();

    DynamicJsonDocument doc(12288);
    DeserializationError error = deserializeJson(doc, payload);
    if (error) {
      setStatus("Bad daemon response", true);
      setRefreshOverlay("", false);
      app.fetchInProgress = false;
      return false;
    }

    app.lastSyncTs = doc["last_sync_ts"] | app.lastSyncTs;
    hasMore = doc["has_more"] | false;
    nextCursor = String(doc["next_cursor"] | "");
    JsonArray events = doc["events"].as<JsonArray>();

    if (!appendEvents(events)) {
      hasMore = false;
      setStatus("Showing first 96 events", true);
    }

    ++pageCount;
  } while (hasMore && nextCursor.length() > 0 && pageCount < 10 && app.eventCount < APP_EVENT_CAPACITY);

  app.lastRefreshMs = millis();
  const time_t now = time(nullptr);
  if (now >= 1700000000) {
    app.lastRenderMinuteTs = now - (now % 60);
  }
  app.fetchInProgress = false;
  if (app.eventCount == 0) {
    setStatus("No upcoming events", true);
  } else {
    setStatus("", false);
  }
  setRefreshOverlay("", false);
  return true;
}

bool triggerDaemonRefresh() {
  if (!app.wifiReady) {
    setStatus("Wi-Fi offline", true);
    setRefreshOverlay("", false);
    return false;
  }

  WiFiClient client;
  HTTPClient http;
  http.setConnectTimeout(8000);
  http.setTimeout(20000);

  const String url = String(APP_DAEMON_URL) + "/v1/refresh";
  if (!http.begin(client, url)) {
    setStatus("Refresh setup failed", true);
    setRefreshOverlay("", false);
    return false;
  }

  http.addHeader("Authorization", String("Bearer ") + APP_API_TOKEN);
  const int httpCode = http.POST("");
  if (httpCode != HTTP_CODE_OK) {
    const String errorText = http.errorToString(httpCode);
    http.end();
    setStatus("Refresh failed: " + errorText, true);
    setRefreshOverlay("", false);
    return false;
  }

  http.end();
  return true;
}

void addDaySection(lv_obj_t *parent, time_t dayStart) {
  lv_obj_t *section = lv_obj_create(parent);
  lv_obj_add_style(section, &style_day_panel, LV_PART_MAIN);
  lv_obj_set_width(section, lv_pct(100));
  lv_obj_set_height(section, LV_SIZE_CONTENT);
  lv_obj_set_layout(section, LV_LAYOUT_FLEX);
  lv_obj_set_flex_flow(section, LV_FLEX_FLOW_COLUMN);
  lv_obj_set_style_pad_gap(section, 10, 0);

  lv_obj_t *title = lv_label_create(section);
  lv_obj_set_style_text_font(title, &app_font_24, 0);
  lv_obj_set_style_text_color(title, lv_color_hex(0xF7FBFF), 0);
  lv_label_set_text(title, formatDayTitle(dayStart).c_str());

  lv_obj_t *subtitle = lv_label_create(section);
  lv_obj_set_style_text_font(subtitle, &app_font_14, 0);
  lv_obj_set_style_text_color(subtitle, lv_color_hex(0x9EB1CB), 0);
  lv_label_set_text(subtitle, formatDaySubtitle(dayStart).c_str());

  bool foundEvents = false;
  const time_t dayEnd = dayStart + 24 * 60 * 60;
  for (int i = 0; i < app.eventCount; ++i) {
    const CalendarEvent &event = app.events[i];
    if (event.endTs <= dayStart || event.startTs >= dayEnd) {
      continue;
    }

    foundEvents = true;
    lv_obj_t *button = lv_button_create(section);
    lv_obj_add_style(button, &style_event_card, LV_PART_MAIN);
    lv_obj_remove_flag(button, LV_OBJ_FLAG_SCROLLABLE);
    lv_obj_add_flag(button, LV_OBJ_FLAG_CLICKABLE);
    lv_obj_add_event_cb(button, onEventPressed, LV_EVENT_CLICKED, &app.events[i]);
    lv_obj_set_width(button, lv_pct(100));
    lv_obj_set_height(button, LV_SIZE_CONTENT);

    lv_obj_set_layout(button, LV_LAYOUT_FLEX);
    lv_obj_set_flex_flow(button, LV_FLEX_FLOW_COLUMN);
    lv_obj_set_style_pad_gap(button, 6, 0);

    lv_obj_t *metaRow = lv_obj_create(button);
    lv_obj_remove_style_all(metaRow);
    lv_obj_set_width(metaRow, lv_pct(100));
    lv_obj_set_height(metaRow, LV_SIZE_CONTENT);
    lv_obj_set_layout(metaRow, LV_LAYOUT_FLEX);
    lv_obj_set_flex_flow(metaRow, LV_FLEX_FLOW_ROW);
    lv_obj_set_flex_align(metaRow, LV_FLEX_ALIGN_SPACE_BETWEEN, LV_FLEX_ALIGN_CENTER, LV_FLEX_ALIGN_CENTER);

    lv_obj_t *timeLabel = lv_label_create(metaRow);
    lv_obj_set_style_text_font(timeLabel, &app_font_16, 0);
    lv_obj_set_style_text_color(timeLabel, lv_color_hex(0xFFD166), 0);
    lv_label_set_text(timeLabel, formatTimeRange(event).c_str());

    const EventTimingState timingState = getEventTimingState(event);
    const String relative = formatEventStatus(event);
    if (!relative.isEmpty()) {
      lv_obj_t *relativeLabel = lv_label_create(metaRow);
      lv_obj_set_style_text_font(relativeLabel, &app_font_16, 0);
      lv_obj_set_style_text_color(relativeLabel, getEventTimingColor(timingState), 0);
      lv_label_set_text(relativeLabel, relative.c_str());
    }

    lv_obj_t *titleLabel = lv_label_create(button);
    lv_obj_set_style_text_font(titleLabel, &app_font_20, 0);
    lv_obj_set_style_text_color(titleLabel, lv_color_hex(0xF4F7FB), 0);
    lv_label_set_long_mode(titleLabel, LV_LABEL_LONG_WRAP);
    lv_obj_set_width(titleLabel, lv_pct(100));
    lv_label_set_text(titleLabel, event.title.c_str());

    if (!event.location.isEmpty()) {
      lv_obj_t *locationLabel = lv_label_create(button);
      lv_obj_set_style_text_font(locationLabel, &app_font_14, 0);
      lv_obj_set_style_text_color(locationLabel, lv_color_hex(0xAFC0D8), 0);
      lv_label_set_long_mode(locationLabel, LV_LABEL_LONG_WRAP);
      lv_obj_set_width(locationLabel, lv_pct(100));
      lv_label_set_text(locationLabel, event.location.c_str());
    }
  }

  if (!foundEvents) {
    lv_obj_t *emptyLabel = lv_label_create(section);
    lv_obj_set_style_text_font(emptyLabel, &app_font_16, 0);
    lv_obj_set_style_text_color(emptyLabel, lv_color_hex(0x8EA2BE), 0);
    lv_label_set_text(emptyLabel, "No events");
  }
}

void rebuildAgenda(bool preserveView = false) {
  if (agenda_panel == nullptr) {
    return;
  }

