fasmide/esp32_calthing/esp32ui/src/main.cpp
  const lv_coord_t preservedScrollY = preserveView ? lv_obj_get_scroll_y(agenda_panel) : 0;
  const bool detailWasOpen = preserveView && detail_overlay != nullptr && !lv_obj_has_flag(detail_overlay, LV_OBJ_FLAG_HIDDEN);
  const String detailEventId = app.openDetailEventId;

  hideDetailOverlay();
  lv_obj_clean(agenda_panel);

  if (!hasAppConfig()) {
    lv_obj_t *label = lv_label_create(agenda_panel);
    lv_obj_set_width(label, lv_pct(100));
    lv_label_set_long_mode(label, LV_LABEL_LONG_WRAP);
    lv_obj_set_style_text_font(label, &app_font_20, 0);
    lv_label_set_text(label, "Set Wi-Fi, daemon URL and API token in app_config.h");
    return;
  }

  for (time_t day = app.rangeStart; day < app.rangeEnd; day += 24 * 60 * 60) {
    addDaySection(agenda_panel, day);
  }

  if (preserveView) {
    lv_obj_scroll_to_y(agenda_panel, preservedScrollY, LV_ANIM_OFF);
  } else {
    lv_obj_scroll_to_y(agenda_panel, 0, LV_ANIM_OFF);
  }

  if (detailWasOpen && !detailEventId.isEmpty()) {
    for (int i = 0; i < app.eventCount; ++i) {
      if (app.events[i].id == detailEventId) {
        showDetailOverlay(app.events[i]);
        break;
      }
    }
  }

  updateBackButtonVisibility();
}

void updateRelativeTimesIfNeeded() {
  if (app.eventCount == 0) {
    return;
  }

  const time_t now = time(nullptr);
  if (now < 1700000000) {
    return;
  }

  const time_t currentMinuteTs = now - (now % 60);
  if (app.lastRenderMinuteTs == currentMinuteTs) {
    return;
  }

  app.lastRenderMinuteTs = currentMinuteTs;
  rebuildAgenda(true);
}

void buildUi() {
  initStyles();

  lv_obj_t *screen = lv_screen_active();
  lv_obj_add_style(screen, &style_screen, LV_PART_MAIN);
  lv_obj_set_style_pad_all(screen, 0, 0);

  agenda_panel = lv_obj_create(screen);
  lv_obj_add_flag(agenda_panel, LV_OBJ_FLAG_SCROLL_ELASTIC);
  lv_obj_set_size(agenda_panel, lv_pct(100), lv_pct(100));
  lv_obj_set_style_pad_all(agenda_panel, 14, 0);
  lv_obj_set_style_pad_gap(agenda_panel, 12, 0);
  lv_obj_set_style_bg_opa(agenda_panel, LV_OPA_TRANSP, 0);
  lv_obj_set_style_border_width(agenda_panel, 0, 0);
  lv_obj_set_layout(agenda_panel, LV_LAYOUT_FLEX);
  lv_obj_set_flex_flow(agenda_panel, LV_FLEX_FLOW_COLUMN);
  lv_obj_set_scrollbar_mode(agenda_panel, LV_SCROLLBAR_MODE_OFF);
  lv_obj_add_event_cb(agenda_panel, onAgendaScrolled, LV_EVENT_SCROLL, nullptr);
  lv_obj_add_event_cb(agenda_panel, onAgendaScrollEnd, LV_EVENT_SCROLL_END, nullptr);

  status_pill = lv_obj_create(screen);
  lv_obj_add_style(status_pill, &style_status, LV_PART_MAIN);
  lv_obj_remove_flag(status_pill, LV_OBJ_FLAG_SCROLLABLE);
  lv_obj_align(status_pill, LV_ALIGN_TOP_MID, 0, 12);
  status_label = lv_label_create(status_pill);
  lv_obj_set_style_text_font(status_label, &app_font_14, 0);
  lv_label_set_text(status_label, "");
  lv_obj_center(status_label);
  lv_obj_add_flag(status_pill, LV_OBJ_FLAG_HIDDEN);

  back_button = lv_button_create(screen);
  lv_obj_add_style(back_button, &style_fab, LV_PART_MAIN);
  lv_obj_remove_flag(back_button, LV_OBJ_FLAG_SCROLLABLE);
  lv_obj_align(back_button, LV_ALIGN_BOTTOM_RIGHT, -18, -18);
  lv_obj_add_event_cb(back_button, onBackPressed, LV_EVENT_CLICKED, nullptr);
  lv_obj_add_flag(back_button, LV_OBJ_FLAG_HIDDEN);
  lv_obj_t *backLabel = lv_label_create(back_button);
  lv_obj_set_style_text_font(backLabel, &app_font_16, 0);
  lv_label_set_text(backLabel, "Back");
  lv_obj_center(backLabel);

  detail_overlay = lv_obj_create(screen);
  lv_obj_remove_flag(detail_overlay, LV_OBJ_FLAG_SCROLLABLE);
  lv_obj_set_size(detail_overlay, lv_pct(100), lv_pct(100));
  lv_obj_set_style_bg_color(detail_overlay, lv_color_hex(0x000000), 0);
  lv_obj_set_style_bg_opa(detail_overlay, LV_OPA_70, 0);
  lv_obj_set_style_border_width(detail_overlay, 0, 0);
  lv_obj_set_style_pad_all(detail_overlay, 0, 0);
  lv_obj_add_event_cb(detail_overlay, onDetailBackdropPressed, LV_EVENT_CLICKED, nullptr);
  lv_obj_add_flag(detail_overlay, LV_OBJ_FLAG_HIDDEN);

  lv_obj_t *modal = lv_obj_create(detail_overlay);
  lv_obj_add_style(modal, &style_modal, LV_PART_MAIN);
  lv_obj_remove_flag(modal, LV_OBJ_FLAG_CLICKABLE);
  lv_obj_set_size(modal, 408, LV_SIZE_CONTENT);
  lv_obj_center(modal);
  lv_obj_set_layout(modal, LV_LAYOUT_FLEX);
  lv_obj_set_flex_flow(modal, LV_FLEX_FLOW_COLUMN);
  lv_obj_set_style_pad_gap(modal, 10, 0);

  detail_title_label = lv_label_create(modal);
  lv_obj_set_style_text_font(detail_title_label, &app_font_24, 0);
  lv_obj_set_style_text_color(detail_title_label, lv_color_hex(0xF7FBFF), 0);
  lv_label_set_long_mode(detail_title_label, LV_LABEL_LONG_WRAP);
  lv_obj_set_width(detail_title_label, lv_pct(100));
  lv_label_set_text(detail_title_label, "");

  detail_body_label = lv_label_create(modal);
  lv_obj_set_style_text_font(detail_body_label, &app_font_16, 0);
  lv_obj_set_style_text_color(detail_body_label, lv_color_hex(0xD2DCEB), 0);
  lv_label_set_long_mode(detail_body_label, LV_LABEL_LONG_WRAP);
  lv_label_set_recolor(detail_body_label, true);
  lv_obj_set_width(detail_body_label, lv_pct(100));
  lv_label_set_text(detail_body_label, "");

  refresh_overlay = lv_obj_create(screen);
  lv_obj_add_style(refresh_overlay, &style_modal, LV_PART_MAIN);
  lv_obj_remove_flag(refresh_overlay, LV_OBJ_FLAG_SCROLLABLE);
  lv_obj_set_size(refresh_overlay, 300, LV_SIZE_CONTENT);
  lv_obj_align(refresh_overlay, LV_ALIGN_CENTER, 0, 0);
  lv_obj_add_flag(refresh_overlay, LV_OBJ_FLAG_HIDDEN);

  refresh_label = lv_label_create(refresh_overlay);
  lv_obj_set_style_text_font(refresh_label, &app_font_20, 0);
  lv_obj_set_style_text_color(refresh_label, lv_color_hex(0xF7FBFF), 0);
  lv_label_set_text(refresh_label, "Refreshing calendar...");
  lv_obj_center(refresh_label);

  rebuildAgenda();
}

void connectWifi() {
  if (!hasAppConfig()) {
    setStatus("Set Wi-Fi, daemon, token", true);
    return;
  }

  WiFi.mode(WIFI_STA);
  // RGB panel + PSRAM framebuffers are much more stable with modem sleep disabled.
  WiFi.setSleep(false);
  WiFi.setAutoReconnect(true);
  WiFi.begin(APP_WIFI_SSID, APP_WIFI_PASSWORD);
  setStatus("Connecting Wi-Fi", true);

  const unsigned long startedAt = millis();
  while (WiFi.status() != WL_CONNECTED && millis() - startedAt < 15000) {
    delay(200);
  }

  app.wifiReady = WiFi.status() == WL_CONNECTED;
  if (!app.wifiReady) {
    setStatus("Wi-Fi connect failed", true);
    return;
  }

  configTzTime(APP_TIMEZONE, "pool.ntp.org", "time.nist.gov");

  const unsigned long clockStartedAt = millis();
  time_t now = time(nullptr);
  while (now < 1700000000 && millis() - clockStartedAt < 10000) {
    delay(200);
    now = time(nullptr);
  }

  app.clockReady = now >= 1700000000;
  app.rangeStart = startOfLocalDay(app.clockReady ? now : time(nullptr));
  app.rangeEnd = app.rangeStart + (APP_QUERY_DAYS * 24 * 60 * 60);
  setStatus(app.clockReady ? "Syncing calendar" : "Wi-Fi ready, no NTP", true);
}

void refreshIfNeeded() {
  if (app.fetchInProgress) {
    return;
  }

  if (!hasAppConfig()) {
    rebuildAgenda();
    return;
  }

