fasmide/esp32_calthing/esp32ui/src/main.cpp
  if (WiFi.status() != WL_CONNECTED) {
    app.wifiReady = false;
    if (millis() - app.lastRefreshMs > 10000 || app.refreshRequested) {
      connectWifi();
    }
  } else {
    app.wifiReady = true;
  }

  if (!app.wifiReady) {
    return;
  }

  const bool stale = millis() - app.lastRefreshMs > APP_REFRESH_INTERVAL_MS;
  if (!app.refreshRequested && !stale) {
    return;
  }

  setRefreshOverlay(app.pullRefreshInProgress ? "Refreshing calendar..." : "Reloading calendar...", true);

  if (app.pullRefreshInProgress) {
    if (!triggerDaemonRefresh()) {
      app.pullRefreshInProgress = false;
      return;
    }
  }

  app.refreshRequested = false;
  if (fetchAgendaWindow()) {
    rebuildAgenda();
  }
  app.pullRefreshInProgress = false;
}

void setupDisplay() {
  touch_init();

  bus = new Arduino_ESP32SPI(GFX_NOT_DEFINED, 39, 48, 47, GFX_NOT_DEFINED);

  Arduino_ESP32RGBPanel *rgbpanel = new Arduino_ESP32RGBPanel(
      18, 17, 16, 21,
      11, 12, 13, 14, 0,
      8, 20, 3, 46, 9, 10,
      4, 5, 6, 7, 15,
      1, 10, 8, 50,
      1, 10, 8, 20,
      0, GFX_NOT_DEFINED, false,
      0, 0, TFT_BOUNCE_BUFFER_PX);

  gfx = new Arduino_RGB_Display(
      480, 480, rgbpanel, 0, false,
      bus, GFX_NOT_DEFINED, st7701_4848s040_init_operations, sizeof(st7701_4848s040_init_operations));

  if (!gfx->begin()) {
    Serial.println("gfx->begin() failed");
  }

  pinMode(GFX_BL, OUTPUT);
  analogWrite(GFX_BL, TFT_BRIGHTNESS);

  gfx->displayOn();
  gfx->fillScreen(BLACK);
  gfx->setRotation((4 - TFT_ROTATION) % 4);
}

void setupLvgl() {
  lv_init();
  lv_tick_set_cb(my_tick);

  lv_display_t *disp = lv_display_create(TFT_HOR_RES, TFT_VER_RES);
  lv_display_set_flush_cb(disp, my_disp_flush);
  lv_display_set_buffers(disp, draw_buf, nullptr, sizeof(draw_buf), LV_DISPLAY_RENDER_MODE_PARTIAL);
  lv_display_set_rotation(disp, TFT_ROTATION);

  lv_indev_t *indev = lv_indev_create();
  lv_indev_set_type(indev, LV_INDEV_TYPE_POINTER);
  lv_indev_set_read_cb(indev, my_touchpad_read);
}

void setup() {
  Serial.begin(115200);
  Serial.println("Starting agenda UI");

  setupDisplay();
  setupLvgl();

  app.rangeStart = startOfLocalDay(time(nullptr));
  app.rangeEnd = app.rangeStart + (APP_QUERY_DAYS * 24 * 60 * 60);

  buildUi();
  connectWifi();
  refreshIfNeeded();
}

void loop() {
  lv_timer_handler();
  gfx->flush();
  refreshIfNeeded();
  updateRelativeTimesIfNeeded();
  delay(5);
}
